---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.FlexPipeType
source: html/b654a08b-48b4-a199-8838-b67db6105360.htm
---
# FlexPipeType Properties

The id of the assembly instance to which the element belongs.